<?php

// php в примерах и задачах [Васильев] - 99 стр. Цикл по массиву

// В качестве индексов массива можно использовать не только целые числа, но и текст. В таком случае вместо термина «индекс», как правило, используют термин «ключ». Массив с текстовыми ключами обычно называют ассоциативным массивом.
// массив с индексными ключами == список
// ассоциативный массив == словарь, таблица

$arr = [1, 2, false];

// вордпресс курс
// https://www.youtube.com/watch?v=eoexOZkswhQ&list=PL3LQJkGQtzc66eiaqOVgIVQ5mw4_6KqDd&index=3&ab_channel=GloAcademy
// https://www.youtube.com/watch?v=ApZV2z46nd4&t=518s&ab_channel=%D0%9E%D1%820%D0%B4%D0%BE1
// 